<a href="https://colab.research.google.com/github/MuhammadHamzaAfzal/Python_Class_Work_jz/blob/master/Pandas_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Filtering Out Missing Data

In [0]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [34]:
data = pd.Series([12,NA,89,NA,34,78,NA])
data

0    12.0
1     NaN
2    89.0
3     NaN
4    34.0
5    78.0
6     NaN
dtype: float64

In [35]:
data.dropna()

0    12.0
2    89.0
4    34.0
5    78.0
dtype: float64

In [36]:
data[data.notnull()]

0    12.0
2    89.0
4    34.0
5    78.0
dtype: float64

In [0]:
obj = pd.DataFrame([[1,NA,45,NA],[23,67,NA,89],[12,NA,NA,67],[23,NA,89,87]])

In [38]:
obj

    0     1     2     3
0   1   NaN  45.0   NaN
1  23  67.0   NaN  89.0
2  12   NaN   NaN  67.0
3  23   NaN  89.0  87.0

# Clean

In [39]:
obj.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [40]:
obj.dropna(how = 'all')

    0     1     2     3
0   1   NaN  45.0   NaN
1  23  67.0   NaN  89.0
2  12   NaN   NaN  67.0
3  23   NaN  89.0  87.0

In [41]:
obj.dropna(how='any')

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [0]:
obj[4] = NA

In [0]:
obj

In [43]:
obj.dropna(axis = 1 , how = 'all')

    0     1     2     3
0   1   NaN  45.0   NaN
1  23  67.0   NaN  89.0
2  12   NaN   NaN  67.0
3  23   NaN  89.0  87.0

In [44]:
obj.dropna(axis = 0 , how = 'any')

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [46]:
obj.dropna(axis = 0 , how = 'all')

    0     1     2     3   4
0   1   NaN  45.0   NaN NaN
1  23  67.0   NaN  89.0 NaN
2  12   NaN   NaN  67.0 NaN
3  23   NaN  89.0  87.0 NaN

In [48]:
data = pd.DataFrame(np.random.randn(7,3))
data

          0         1         2
0 -0.616021 -0.172296  0.767986
1 -0.589755 -0.808349 -0.440580
2  0.493098  0.263800  0.911399
3  0.082592  0.318916  1.320178
4 -0.220070  1.209319  2.248250
5  0.980183 -0.795790  0.466187
6  0.017298 -0.434257 -2.039903

In [0]:
data.iloc[:3,1] = NA

In [52]:
data

          0         1         2
0 -0.616021       NaN  0.767986
1 -0.589755       NaN -0.440580
2  0.493098       NaN  0.911399
3  0.082592  0.318916  1.320178
4 -0.220070  1.209319  2.248250
5  0.980183 -0.795790  0.466187
6  0.017298 -0.434257 -2.039903

In [0]:
data.iloc[4:,2] = NA

In [54]:
data

          0         1         2
0 -0.616021       NaN  0.767986
1 -0.589755       NaN -0.440580
2  0.493098       NaN  0.911399
3  0.082592  0.318916  1.320178
4 -0.220070  1.209319       NaN
5  0.980183 -0.795790       NaN
6  0.017298 -0.434257       NaN

In [55]:
data.dropna(thresh = 2)

          0         1         2
0 -0.616021       NaN  0.767986
1 -0.589755       NaN -0.440580
2  0.493098       NaN  0.911399
3  0.082592  0.318916  1.320178
4 -0.220070  1.209319       NaN
5  0.980183 -0.795790       NaN
6  0.017298 -0.434257       NaN